In [3]:
#imports
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt

/Library/Frameworks/Python.framework/Versions/3.6/lib/python3.6/site-packages/matplotlib/font_manager.py:278: UserWarning: Matplotlib is building the font cache using fc-list. This may take a moment.
  'Matplotlib is building the font cache using fc-list. '

In [4]:
s = pd.Series([1,3,5,np.nan,6,8])

In [5]:
s

0    1.0
1    3.0
2    5.0
3    NaN
4    6.0
5    8.0
dtype: float64

In [6]:
dates = pd.date_range('20130101', periods=6)

In [7]:
dates

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

In [9]:
df2 = pd.DataFrame({ 'A' : 1.,
                             'B' : pd.Timestamp('20130102'),
                             'C' : pd.Series(1,index=list(range(4)),dtype='float32'),
                             'D' : np.array([3] * 4,dtype='int32'),
                             'E' : pd.Categorical(["test","train","test","train"]),
                             'F' : 'foo' })

In [10]:
df2

     A          B    C  D      E    F
0  1.0 2013-01-02  1.0  3   test  foo
1  1.0 2013-01-02  1.0  3  train  foo
2  1.0 2013-01-02  1.0  3   test  foo
3  1.0 2013-01-02  1.0  3  train  foo

In [11]:
df2.dtypes

A           float64
B    datetime64[ns]
C           float32
D             int32
E          category
F            object
dtype: object

In [14]:
df = pd.DataFrame(np.random.randn(6,4), index=dates, columns=list('ABCD'))

In [15]:
df

                   A         B         C         D
2013-01-01 -0.292831 -0.557033  0.462977  0.799576
2013-01-02 -1.244160 -1.061798 -0.953793  1.564183
2013-01-03  0.617840 -1.389700  1.152479  1.246963
2013-01-04 -0.265774 -2.422939 -0.030603  0.446709
2013-01-05  1.164887  0.748148 -1.799456 -1.768500
2013-01-06 -0.755998  0.060493 -0.237182 -0.239303

In [16]:
df.head()
df.tail(3)

                   A         B         C         D
2013-01-04 -0.265774 -2.422939 -0.030603  0.446709
2013-01-05  1.164887  0.748148 -1.799456 -1.768500
2013-01-06 -0.755998  0.060493 -0.237182 -0.239303

In [17]:
df.index

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

In [18]:
df.columns

Index(['A', 'B', 'C', 'D'], dtype='object')

In [19]:
df.values

array([[-0.29283095, -0.55703339,  0.46297689,  0.79957558],
       [-1.24415984, -1.0617978 , -0.95379251,  1.56418339],
       [ 0.61783994, -1.38969959,  1.15247857,  1.24696259],
       [-0.26577371, -2.42293933, -0.03060292,  0.44670934],
       [ 1.16488707,  0.74814805, -1.79945633, -1.76849954],
       [-0.75599751,  0.0604925 , -0.23718186, -0.23930345]])

In [20]:
df.describe()

              A         B         C         D
count  6.000000  6.000000  6.000000  6.000000
mean  -0.129339 -0.770472 -0.234263  0.341605
std    0.884779  1.117249  1.040984  1.210384
min   -1.244160 -2.422939 -1.799456 -1.768500
25%   -0.640206 -1.307724 -0.774640 -0.067800
50%   -0.279302 -0.809416 -0.133892  0.623142
75%    0.396937 -0.093889  0.339582  1.135116
max    1.164887  0.748148  1.152479  1.564183

In [21]:
df.T

   2013-01-01  2013-01-02  2013-01-03  2013-01-04  2013-01-05  2013-01-06
A   -0.292831   -1.244160    0.617840   -0.265774    1.164887   -0.755998
B   -0.557033   -1.061798   -1.389700   -2.422939    0.748148    0.060493
C    0.462977   -0.953793    1.152479   -0.030603   -1.799456   -0.237182
D    0.799576    1.564183    1.246963    0.446709   -1.768500   -0.239303

In [25]:
df.sort_index(axis=1, ascending=False)

                   D         C         B         A
2013-01-01  0.799576  0.462977 -0.557033 -0.292831
2013-01-02  1.564183 -0.953793 -1.061798 -1.244160
2013-01-03  1.246963  1.152479 -1.389700  0.617840
2013-01-04  0.446709 -0.030603 -2.422939 -0.265774
2013-01-05 -1.768500 -1.799456  0.748148  1.164887
2013-01-06 -0.239303 -0.237182  0.060493 -0.755998

In [28]:
df.sort_values(by='B')

                   A         B         C         D
2013-01-04 -0.265774 -2.422939 -0.030603  0.446709
2013-01-03  0.617840 -1.389700  1.152479  1.246963
2013-01-02 -1.244160 -1.061798 -0.953793  1.564183
2013-01-01 -0.292831 -0.557033  0.462977  0.799576
2013-01-06 -0.755998  0.060493 -0.237182 -0.239303
2013-01-05  1.164887  0.748148 -1.799456 -1.768500

In [29]:
df['A']

2013-01-01   -0.292831
2013-01-02   -1.244160
2013-01-03    0.617840
2013-01-04   -0.265774
2013-01-05    1.164887
2013-01-06   -0.755998
Freq: D, Name: A, dtype: float64

In [30]:
df[0:3]

                   A         B         C         D
2013-01-01 -0.292831 -0.557033  0.462977  0.799576
2013-01-02 -1.244160 -1.061798 -0.953793  1.564183
2013-01-03  0.617840 -1.389700  1.152479  1.246963

In [31]:
df['20130102':'20130104']

                   A         B         C         D
2013-01-02 -1.244160 -1.061798 -0.953793  1.564183
2013-01-03  0.617840 -1.389700  1.152479  1.246963
2013-01-04 -0.265774 -2.422939 -0.030603  0.446709

In [32]:
df.loc[dates[0]]

A   -0.292831
B   -0.557033
C    0.462977
D    0.799576
Name: 2013-01-01 00:00:00, dtype: float64

In [33]:
df.loc[:,['A','B']]

                   A         B
2013-01-01 -0.292831 -0.557033
2013-01-02 -1.244160 -1.061798
2013-01-03  0.617840 -1.389700
2013-01-04 -0.265774 -2.422939
2013-01-05  1.164887  0.748148
2013-01-06 -0.755998  0.060493

In [34]:
df.loc['20130102':'20130104',['A','B']]

                   A         B
2013-01-02 -1.244160 -1.061798
2013-01-03  0.617840 -1.389700
2013-01-04 -0.265774 -2.422939

In [35]:
df.loc['20130102',['A','B']]

A   -1.244160
B   -1.061798
Name: 2013-01-02 00:00:00, dtype: float64

In [36]:
df.loc[dates[0],'A']

-0.29283094797446857

In [37]:
df.at[dates[0],'A']

-0.29283094797446857

In [38]:
df.iloc[3]

A   -0.265774
B   -2.422939
C   -0.030603
D    0.446709
Name: 2013-01-04 00:00:00, dtype: float64

In [39]:
df.iloc[3:5,0:2]

                   A         B
2013-01-04 -0.265774 -2.422939
2013-01-05  1.164887  0.748148

In [40]:
df.iloc[[1,2,4],[0,2]]

                   A         C
2013-01-02 -1.244160 -0.953793
2013-01-03  0.617840  1.152479
2013-01-05  1.164887 -1.799456

In [41]:
df[df.A > 0]

                   A         B         C         D
2013-01-03  0.617840 -1.389700  1.152479  1.246963
2013-01-05  1.164887  0.748148 -1.799456 -1.768500

In [44]:
df[df > 0]

                   A         B         C         D
2013-01-01       NaN       NaN  0.462977  0.799576
2013-01-02       NaN       NaN       NaN  1.564183
2013-01-03  0.617840       NaN  1.152479  1.246963
2013-01-04       NaN       NaN       NaN  0.446709
2013-01-05  1.164887  0.748148       NaN       NaN
2013-01-06       NaN  0.060493       NaN       NaN

In [45]:
df2 = df.copy()

In [46]:
df2['E'] = ['one', 'one','two','three','four','three']

In [47]:
df2[df2['E'].isin(['two','four'])]

                   A         B         C         D     E
2013-01-03  0.617840 -1.389700  1.152479  1.246963   two
2013-01-05  1.164887  0.748148 -1.799456 -1.768500  four

In [48]:
s1 = pd.Series([1,2,3,4,5,6], index=pd.date_range('20130102', periods=6))

In [49]:
df['F'] = s1

In [50]:
df

                   A         B         C         D    F
2013-01-01 -0.292831 -0.557033  0.462977  0.799576  NaN
2013-01-02 -1.244160 -1.061798 -0.953793  1.564183  1.0
2013-01-03  0.617840 -1.389700  1.152479  1.246963  2.0
2013-01-04 -0.265774 -2.422939 -0.030603  0.446709  3.0
2013-01-05  1.164887  0.748148 -1.799456 -1.768500  4.0
2013-01-06 -0.755998  0.060493 -0.237182 -0.239303  5.0

In [51]:
df.at[dates[0],'A'] = 0

In [52]:
df.iat[0,1] = 0

In [54]:
df.loc[:,'D'] = np.array([5] * len(df))

In [55]:
df

                   A         B         C  D    F
2013-01-01  0.000000  0.000000  0.462977  5  NaN
2013-01-02 -1.244160 -1.061798 -0.953793  5  1.0
2013-01-03  0.617840 -1.389700  1.152479  5  2.0
2013-01-04 -0.265774 -2.422939 -0.030603  5  3.0
2013-01-05  1.164887  0.748148 -1.799456  5  4.0
2013-01-06 -0.755998  0.060493 -0.237182  5  5.0

In [56]:
df2 = df.copy()

In [57]:
df2[df2 > 0] = -df2

In [58]:
df2

                   A         B         C  D    F
2013-01-01  0.000000  0.000000 -0.462977 -5  NaN
2013-01-02 -1.244160 -1.061798 -0.953793 -5 -1.0
2013-01-03 -0.617840 -1.389700 -1.152479 -5 -2.0
2013-01-04 -0.265774 -2.422939 -0.030603 -5 -3.0
2013-01-05 -1.164887 -0.748148 -1.799456 -5 -4.0
2013-01-06 -0.755998 -0.060493 -0.237182 -5 -5.0

In [59]:
df1 = df.reindex(index=dates[0:4], columns=list(df.columns) + ['E'])

In [60]:
df1.loc[dates[0]:dates[1],'E'] = 1

In [61]:
df1

                   A         B         C  D    F    E
2013-01-01  0.000000  0.000000  0.462977  5  NaN  1.0
2013-01-02 -1.244160 -1.061798 -0.953793  5  1.0  1.0
2013-01-03  0.617840 -1.389700  1.152479  5  2.0  NaN
2013-01-04 -0.265774 -2.422939 -0.030603  5  3.0  NaN

In [62]:
 df1.dropna(how='any')

                  A         B         C  D    F    E
2013-01-02 -1.24416 -1.061798 -0.953793  5  1.0  1.0

In [63]:
df1.fillna(value=5)

                   A         B         C  D    F    E
2013-01-01  0.000000  0.000000  0.462977  5  5.0  1.0
2013-01-02 -1.244160 -1.061798 -0.953793  5  1.0  1.0
2013-01-03  0.617840 -1.389700  1.152479  5  2.0  5.0
2013-01-04 -0.265774 -2.422939 -0.030603  5  3.0  5.0

In [64]:
pd.isna(df1)

                A      B      C      D      F      E
2013-01-01  False  False  False  False   True  False
2013-01-02  False  False  False  False  False  False
2013-01-03  False  False  False  False  False   True
2013-01-04  False  False  False  False  False   True

In [65]:
df.mean()

A   -0.080534
B   -0.677633
C   -0.234263
D    5.000000
F    3.000000
dtype: float64

In [66]:
df.mean(1)

2013-01-01    1.365744
2013-01-02    0.548050
2013-01-03    1.476124
2013-01-04    1.056137
2013-01-05    1.822716
2013-01-06    1.813463
Freq: D, dtype: float64

In [67]:
s = pd.Series([1,3,5,np.nan,6,8], index=dates).shift(2)

In [68]:
s

2013-01-01    NaN
2013-01-02    NaN
2013-01-03    1.0
2013-01-04    3.0
2013-01-05    5.0
2013-01-06    NaN
Freq: D, dtype: float64

In [69]:
df.sub(s, axis='index')

                   A         B         C    D    F
2013-01-01       NaN       NaN       NaN  NaN  NaN
2013-01-02       NaN       NaN       NaN  NaN  NaN
2013-01-03 -0.382160 -2.389700  0.152479  4.0  1.0
2013-01-04 -3.265774 -5.422939 -3.030603  2.0  0.0
2013-01-05 -3.835113 -4.251852 -6.799456  0.0 -1.0
2013-01-06       NaN       NaN       NaN  NaN  NaN

In [70]:
df.apply(np.cumsum)

                   A         B         C   D     F
2013-01-01  0.000000  0.000000  0.462977   5   NaN
2013-01-02 -1.244160 -1.061798 -0.490816  10   1.0
2013-01-03 -0.626320 -2.451497  0.661663  15   3.0
2013-01-04 -0.892094 -4.874437  0.631060  20   6.0
2013-01-05  0.272793 -4.126289 -1.168396  25  10.0
2013-01-06 -0.483204 -4.065796 -1.405578  30  15.0

In [71]:
df.apply(lambda x: x.max() - x.min())

A    2.409047
B    3.171087
C    2.951935
D    0.000000
F    4.000000
dtype: float64

In [72]:
s = pd.Series(np.random.randint(0, 7, size=10))

In [73]:
s

0    3
1    1
2    6
3    3
4    5
5    4
6    2
7    0
8    6
9    0
dtype: int64

In [74]:
s.value_counts()

6    2
3    2
0    2
5    1
4    1
2    1
1    1
dtype: int64

In [75]:
s = pd.Series(['A', 'B', 'C', 'Aaba', 'Baca', np.nan, 'CABA', 'dog', 'cat'])

In [76]:
s.str.lower()

0       a
1       b
2       c
3    aaba
4    baca
5     NaN
6    caba
7     dog
8     cat
dtype: object

In [81]:
df = pd.DataFrame(np.random.randn(10, 4))
df

          0         1         2         3
0 -1.459581 -0.646477  1.195862  1.689536
1 -0.361679 -1.382139 -0.527379 -1.742228
2 -0.334240  0.292350  0.228599 -1.387914
3 -0.268243 -0.129091  0.979825  0.087593
4 -0.649859  0.027531 -0.152510  0.327664
5  0.431471 -1.190399 -0.102875  0.248498
6 -1.346744 -0.037189  1.279226  1.695931
7 -0.648107 -1.318422  1.603963 -0.256121
8  0.559082 -0.505436 -0.220999 -0.655870
9 -0.528126  0.547444  1.271246 -0.998273

In [84]:
pieces = [df[:3], df[3:7], df[7:]]
pieces

[          0         1         2         3
 0 -1.459581 -0.646477  1.195862  1.689536
 1 -0.361679 -1.382139 -0.527379 -1.742228
 2 -0.334240  0.292350  0.228599 -1.387914,
           0         1         2         3
 3 -0.268243 -0.129091  0.979825  0.087593
 4 -0.649859  0.027531 -0.152510  0.327664
 5  0.431471 -1.190399 -0.102875  0.248498
 6 -1.346744 -0.037189  1.279226  1.695931,
           0         1         2         3
 7 -0.648107 -1.318422  1.603963 -0.256121
 8  0.559082 -0.505436 -0.220999 -0.655870
 9 -0.528126  0.547444  1.271246 -0.998273]

In [83]:
pd.concat(pieces)

          0         1         2         3
0 -1.459581 -0.646477  1.195862  1.689536
1 -0.361679 -1.382139 -0.527379 -1.742228
2 -0.334240  0.292350  0.228599 -1.387914
3 -0.268243 -0.129091  0.979825  0.087593
4 -0.649859  0.027531 -0.152510  0.327664
5  0.431471 -1.190399 -0.102875  0.248498
6 -1.346744 -0.037189  1.279226  1.695931
7 -0.648107 -1.318422  1.603963 -0.256121
8  0.559082 -0.505436 -0.220999 -0.655870
9 -0.528126  0.547444  1.271246 -0.998273

In [85]:
left = pd.DataFrame({'key': ['foo', 'foo'], 'lval': [1, 2]})

In [86]:
right = pd.DataFrame({'key': ['foo', 'foo'], 'rval': [4, 5]})

In [87]:
left

   key  lval
0  foo     1
1  foo     2

In [89]:
right

   key  rval
0  foo     4
1  foo     5

In [90]:
pd.merge(left, right, on='key')

   key  lval  rval
0  foo     1     4
1  foo     1     5
2  foo     2     4
3  foo     2     5

In [92]:
df = pd.DataFrame({'A' : ['foo', 'bar', 'foo', 'bar',
   ....:                           'foo', 'bar', 'foo', 'foo'],
   ....:                    'B' : ['one', 'one', 'two', 'three',
   ....:                           'two', 'two', 'one', 'three'],
   ....:                    'C' : np.random.randn(8),
   ....:                    'D' : np.random.randn(8)})

In [93]:
df.groupby('A').sum()

            C         D
A
bar  0.484755 -3.248340
foo  0.990934 -1.356932

In [94]:
df.groupby(['A','B']).sum()

                  C         D
A   B
bar one   -0.429611 -1.760753
    three -0.474877 -0.440862
    two    1.389243 -1.046725
foo one    0.449750 -0.206288
    three  0.020728 -0.658619
    two    0.520457 -0.492025

In [95]:
tuples = list(zip(*[['bar', 'bar', 'baz', 'baz',
   ....:                      'foo', 'foo', 'qux', 'qux'],
   ....:                     ['one', 'two', 'one', 'two',
   ....:                      'one', 'two', 'one', 'two']]))
   ....:

In [96]:
index = pd.MultiIndex.from_tuples(tuples, names=['first', 'second'])

In [97]:
df = pd.DataFrame(np.random.randn(8, 2), index=index, columns=['A', 'B'])

In [98]:
df2 = df[:4]

In [99]:
df2

                     A         B
first second
bar   one     1.140033  0.556072
      two     2.243895 -1.020515
baz   one     1.194943  0.055184
      two     0.685399 -0.731653

In [100]:
stacked = df2.stack()